---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.SchedulesCanBePlacedOnSheetsOnly
source: html/5890ac31-13e8-6cb9-5c1a-093adbf2734e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.SchedulesCanBePlacedOnSheetsOnly Property

Schedules can only be placed on Sheets.

## Syntax (C#)
```csharp
public static FailureDefinitionId SchedulesCanBePlacedOnSheetsOnly { get; }
```